grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_device.h
/** OTG_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN Receive threshold enable **/
#define OTG_HS_DEVICE_OTG_HS_DTHRCTL_RXTHREN		(1 << 16)

#define OTG_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_SHIFT		2
#define OTG_HS_DEVICE_OTG_HS_DTHRCTL_TXTHRLEN_MASK		0x1ff
/** @defgroup otg_hs_device_otg_hs_dthrctl_txthrlen TXTHRLEN Transmit threshold length
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN ISO IN endpoint threshold enable **/
#define OTG_HS_DEVICE_OTG_HS_DTHRCTL_ISOTHREN		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN Nonisochronous IN endpoints threshold enable **/
#define OTG_HS_DEVICE_OTG_HS_DTHRCTL_NONISOTHREN		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepempmsk OTGHSDIEPEMPMSK OTG_HS device IN endpoint FIFO empty interrupt mask register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPEMPMSK_INEPTXFEM_MASK		0xffff
/** @defgroup otg_hs_device_otg_hs_diepempmsk_ineptxfem INEPTXFEM IN EP Tx FIFO empty interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_deachint OTGHSDEACHINT OTG_HS device each endpoint interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT OUT endpoint 1 interrupt bit **/
#define OTG_HS_DEVICE_OTG_HS_DEACHINT_OEP1INT		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT IN endpoint 1interrupt bit **/
#define OTG_HS_DEVICE_OTG_HS_DEACHINT_IEP1INT		(1 << 1)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_deachintmsk OTGHSDEACHINTMSK OTG_HS device each endpoint interrupt register mask
@{*/

/** OTG_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM OUT Endpoint 1 interrupt mask bit **/
#define OTG_HS_DEVICE_OTG_HS_DEACHINTMSK_OEP1INTM		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM IN Endpoint 1 interrupt mask bit **/
#define OTG_HS_DEVICE_OTG_HS_DEACHINTMSK_IEP1INTM		(1 << 1)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepctl0 OTGHSDIEPCTL0 OTG device endpoint-0 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_CNAK		(1 << 26)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_SHIFT		22
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_TXFNUM_MASK		0x0f
/** @defgroup otg_hs_device_otg_hs_diepctl0_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL0_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint0 OTGHSDIEPINT0 OTG device endpoint-0 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz0 OTGHSDIEPTSIZ0 OTG_HS device IN endpoint 0 transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_hs_device_otg_hs_dieptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma0 OTGHSDIEPDMA0 OTG_HS device endpoint-1 DMA address register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPDMA0_DMAADDR_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPDMA0_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_device_otg_hs_diepdma0_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_dtxfsts0 OTGHSDTXFSTS0 OTG_HS device IN endpoint transmit FIFO status register
@{*/


