grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_device.h
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_SHIFT		22
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_TXFNUM_MASK		0x0f
/** @defgroup otg_hs_device_otg_hs_diepctl4_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL4_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl4_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL4_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl4_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint4 OTGHSDIEPINT4 OTG device endpoint-4 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT4_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz4 OTGHSDIEPTSIZ4 OTG_HS device endpoint transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_MCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz4_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_dieptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_device_otg_hs_dieptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma4 OTGHSDIEPDMA4 OTG_HS device endpoint-5 DMA address register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPDMA4_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_device_otg_hs_diepdma4_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_dtxfsts4 OTGHSDTXFSTS4 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DTXFSTS4_INEPTFSAV_MASK		0xffff
/** @defgroup otg_hs_device_otg_hs_dtxfsts4_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepctl5 OTGHSDIEPCTL5 OTG device endpoint-5 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_CNAK		(1 << 26)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_SHIFT		22
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_TXFNUM_MASK		0x0f
/** @defgroup otg_hs_device_otg_hs_diepctl5_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint5 OTGHSDIEPINT5 OTG device endpoint-5 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz5 OTGHSDIEPTSIZ5 OTG_HS device endpoint transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz5_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_dieptsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


