grevaillot/svd_tools/headers/STM32H7x7_CM7/otg_hs_device.h
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl7_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint7 OTGHSDIEPINT7 OTG device endpoint-7 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT7_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT7_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz7 OTGHSDIEPTSIZ7 OTG_HS device endpoint transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_MCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz7_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_dieptsiz7_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ7_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_device_otg_hs_dieptsiz7_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma7 OTGHSDIEPDMA7 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_dtxfsts7 OTGHSDTXFSTS7 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DTXFSTS7_INEPTFSAV_MASK		0xffff
/** @defgroup otg_hs_device_otg_hs_dtxfsts7_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma8 OTGHSDIEPDMA8 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma9 OTGHSDIEPDMA9 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma10 OTGHSDIEPDMA10 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma11 OTGHSDIEPDMA11 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma12 OTGHSDIEPDMA12 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma13 OTGHSDIEPDMA13 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma14 OTGHSDIEPDMA14 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma15 OTGHSDIEPDMA15 OTG Device channel-x DMA address register
@{*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepctl0 OTGHSDOEPCTL0 OTG_HS device control OUT endpoint 0 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_CNAK		(1 << 26)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_Stall		(1 << 21)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM Snoop mode **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_SNPM		(1 << 20)

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint0 OTGHSDOEPINT0 OTG_HS device endpoint-0 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT0_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT0_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT0_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT0_XFRC		(1 << 0)

/**@}*/

